InformationRegisters/ИА_НастройкиЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_НастройкиЗначения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ИА_НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ИА_НастройкиСПИ/Ext/Module.bsl
Функция ЗначениеНастройки(Пользователь, ЭлементНастройка) Экспорт
    Если ТипЗнч(ЭлементНастройка) = Тип("Строка") Тогда
        Настройка = ПланыВидовХарактеристик.ИА_НастройкиПользователей[ЭлементНастройка];
    Иначе
        Настройка = ЭлементНастройка;
    КонецЕсли;
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Настройка = ПланыВидовХарактеристик.ИА_НастройкиПользователей.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    
    Контекст = Новый Структура("Пользователь, Настройка, Значение"
    , Пользователь, Настройка, Настройка.ЗначениеПоУмолчанию);
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ИА_НастройкиЗначения.Пользователь,
    |	ИА_НастройкиЗначения.Настройка,
    |	ИА_НастройкиЗначения.Значение
    |ИЗ
    |	РегистрСведений.ИА_НастройкиЗначения КАК ИА_НастройкиЗначения
    |ГДЕ
    |	ИА_НастройкиЗначения.Пользователь = &Пользователь
    |	И ИА_НастройкиЗначения.Настройка = &Настройка";
    
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Настройка", Настройка);
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Контекст.Значение = Выборка.Значение;
    КонецЕсли;
    
    Контекст.Значение = Настройка.ТипЗначения.ПривестиЗначение(Контекст.Значение); // т.к. м.б. "неопределено"
    ИА_НастройкиСПереопределяемый.ЗначениеНастройки(Контекст);
    
    Возврат Контекст.Значение;
КонецФункции
